# -*- coding:utf-8 -*-
import random


def randomName():
    x = "赵钱孙李周吴郑王冯陈杨朱秦张曹孔马唐成何"
    m = "吉惟国瑞😀ོ🐎玟书雅😀ོ🐎南奕云柏宏建安😀ོ🐎子帆志豪😀ོ🐎茹定中冰文隆彦😀ོ🐎文智翔振霞姿😀ོ🐎婷姿康致盈一强芸贵伊雯进宝美😀ོ🐎隆心真美珠芳天雅惠文婷敏侑依婷婉璇美玉依婷昌梦家纶丽昆育泉芸欢韵如肇芬木仲成白兆玉翊惠汉臻佳瑞绿珮白芷姿妤虹伦琼玟怡芳贵妃佩芳文旺盛玫丽青智云孟涵小爱恩龙政廷诗涵政倩俊伯馨学惠珠思翰佩玲海来翊依建智淑芬雅琪怡宜育霖仪湖俊民诗刚慧颖俊君淑妤姿伶咏钰彦宜孟儒欣臻祯韵洁启哲宇晓萍雅萍志铭茂以婉婷宜芸珮瑜柏仪逸珮雅惠采珮孟霖竹水怡乐爱乐佳蓉健毓士杰萱珍姿婷政霖志宏素达虹荣美玲仪琳俞幸秋萍吉维智筠书玮信峰培伦瑜舜慧萱士易建豪怡婷紫富博海宏儒乔喜睿纯淑月百菁雅娥佩珊必辰耀华郁婷秀玲佳儒静蓁舒南政琳绍瑜育木韦成宁政廷湖展霞婉宏怡强冰宇伟依元映智超姿婷莉火雅雯淑芳枝盈成彦采伶大雪彦韦升毓宜瑶政文宜豪宜宁志宏柔治乐妹健昀雅君佩芬玮伦娇真佳雯仁杰佳和贤青怡伶怡婷晴桦翔坤孟富美玲昀琬凯修蓉芳吟琪裕忠春紫美君右博星如冠杰庭玮茜彦伯薇昭祥伟伦雅慧子豪彦霖雅婷圣如伶元伦军佳蓉康柔成轩嘉惠惠劭健铭怡婷佳蓉佩伯珮甄晓玲彦霖威强佳勋静怡筠亚仲宜东贵绍翰姵来雅吉莉雯韦荣素伦菁芷玉婷智钧孟钰国伟俊达雅婷礼娇忆孝静雯淳宝文育佳蓉依茂淑佩怡君美玲慧学幸韵秀琬岳平爱礼一忠志雪若喜承翰哲维俊安礼钰佩珊鸿信欣瑜旺劭怡爱秀德佳伶凯婷雅任国妹芳江骏生儒纯培伦侑宜慧信意惠雯琇纶碧仪志文懿富凡靖秀琴惠玲宗其绍泰佳慧辰纶雅雯怡财雅筑伦圣正仁小紫燕达佳雨婷婷怡君康刚辰和世人佩霖伟杰友淳瑞群紫芬家伟佩任郁文治火石美雅茜台泰怡盈石意盈威志嘉秀玲彦霖惟芷星钰贞伟扬云武盛雅顺欣仪政圣育福惠雯淑淑莉秋俊军彦璋怡均姿辛雅慧允坚淑珍惠美凯婷承辰亭宝慧元书忠仪礼哲仪怡臻孝东志合力霞钰婷怡紫俊凯于纬雅惠喜祥铭侑子珠伦吉佳雨英贤嘉茹永桂文宏欣怡绍燕雅谕柏宇婉萍宗清心霖柏廷怡臻士豪春勋雅慧乔茂婉如育坚静雯一蓉萱俐立妹宝其信豪昆霖俊安建志韦伶美麟政达惠玲忠廷美娟怡君崇南承芷得梅祯月宛儒肇宪益霞盛人平纬雅如秀绮昌东家荣淑君俊民彦瑜彦文崇以威全琳以志任嘉杰志远信文思廷家毓宜紫毅民志平坚凤明春火劭予名佩璇雅雯宗毅淑媛淑卿雅萍佩木惠玲乃亚欣怡意婷明珠淑婷宏亦佳德正信淑敏佳玲佳明淑惠雅菱淳奇芳仪俊玮雯坚文贤雅雯雅俐婉婷智杰玉信侑美怡婷世祥韦水彦慈峻香轩天妤军佩玲美芝伦启敏爱毓娇姿君姿泰圣映柏燕馨香于玟山茹得凤明翰冠强文荣静雯伟孝信俊美治景隆怡洁钰梦静宜惠如香君汉馨"
    x1 = x[random.randrange(1,len(x) - 1)]
    m1 = ""
    for i in range(0,2):
        m1 += m[random.randrange(1,len(m)-1)]
    name = x1+m1
    return name


if __name__ == "__main__":
    print(randomName())